AccumulationRegisters/ПартииТоваровНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииТоваровНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПродСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьВал</Name>
					<Comment>Сумма в валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УдалитьКатегория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорСчет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Внутренний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтделыВМагазинах</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Внутренний</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидХранения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыХраненияЗапасов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МОЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделительУчёта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделителиУчёта</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Catalogs/ОтделыВМагазинах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>ОтделыВМагазинах</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДенежныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РасчетныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/РозницаСервер/Ext/Module.bsl
//	----------------------------------------------------------------------------
//	ПолучитьПараметрыОтдела()
//		СтруктураПараметров = Структура("Организация, Контрагент")
//
Функция ПолучитьПараметрыОтдела(СтруктураПараметров) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ОтделыВМагазинах.Ссылка,
	|	ОтделыВМагазинах.Подразделение,
	|	ОтделыВМагазинах.ДенежныйСчет,
	|	ОтделыВМагазинах.Склад
	|ИЗ
	|	Справочник.ОтделыВМагазинах КАК ОтделыВМагазинах
	|ГДЕ
	|	ОтделыВМагазинах.Магазин = &Контрагент
	|	И ВЫБОР
	|			КОГДА &ЕстьОрганизация
	|				ТОГДА ОтделыВМагазинах.Организация = &Организация
	|						ИЛИ ОтделыВМагазинах.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ");
	
	
	Запрос.УстановитьПараметр("Организация", СтруктураПараметров.Организация);
	Запрос.УстановитьПараметр("ЕстьОрганизация", ЗначениеЗаполнено(СтруктураПараметров.Организация));
	Запрос.УстановитьПараметр("Контрагент", СтруктураПараметров.Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		СтруктураПараметров.Вставить("Подразделение", 	Неопределено);
		СтруктураПараметров.Вставить("Склад", 			Неопределено);
		СтруктураПараметров.Вставить("ДенежныйСчет", 	Неопределено);
		СтруктураПараметров.Вставить("ОтделМагазина", 	Неопределено);
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		СтруктураПараметров.Вставить("Подразделение", 	Выборка.Подразделение);
		СтруктураПараметров.Вставить("Склад", 			Выборка.Склад);
		СтруктураПараметров.Вставить("ДенежныйСчет", 	Выборка.ДенежныйСчет);
		СтруктураПараметров.Вставить("ОтделМагазина", 	Выборка.Ссылка);
		
	КонецЕсли;
	
	Возврат (СтруктураПараметров)
	
КонецФункции	// ПолучитьПараметрыОтдела()


//	----------------------------------------------------------------------------
//	ПолучитьРеализованнуюНаценку()
//		СтруктураПараметров = Структура("Подразделение, ОтделМагазина, Дата, СуммаРеализации")
//
Функция ПолучитьРеализованнуюНаценку(СтруктураПараметров) Экспорт
	
	РеализованнаяНаценка = 0;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПартииТоваровНаСкладахОстатки.СтоимостьОстаток КАК Стоимость,
	|	ПартииТоваровНаСкладахОстатки.ПродСтоимостьОстаток КАК ПродСтоимость
	|ИЗ
	|	РегистрНакопления.ПартииТоваровНаСкладах.Остатки(
	|			&ДатаОстатков,
	|			Подразделение = &Подразделение
	|				И ЦФО = &ЦФО) КАК ПартииТоваровНаСкладахОстатки");
	
	Запрос.УстановитьПараметр("ДатаОстатков", 	Новый Граница(СтруктураПараметров.Дата, ВидГраницы.Включая) );
	Запрос.УстановитьПараметр("Подразделение", 	СтруктураПараметров.Подразделение);
	Запрос.УстановитьПараметр("ЦФО", 			СтруктураПараметров.ОтделМагазина);
	
	//сообщить(СтруктураПараметров.Дата);
	//сообщить(СтруктураПараметров.Подразделение);
	//сообщить(СтруктураПараметров.ОтделМагазина);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		//сообщить(Выборка.Стоимость);
		//сообщить(Выборка.ПродСтоимость);
		
		Если НЕ (Выборка.ПродСтоимость = 0) И НЕ(Выборка.Стоимость > Выборка.ПродСтоимость) Тогда
			
			РеализованнаяНаценка = Окр(СтруктураПараметров.СуммаРеализации *(1 - Выборка.Стоимость / Выборка.ПродСтоимость), 2,РежимОкругления.Окр15как20);
			
		КонецЕсли;
		
		Если РеализованнаяНаценка <= 0 Тогда
			//РеализованнаяНаценка = 0;
			РеализованнаяНаценка = Окр(СтруктураПараметров.СуммаРеализации * 0.164, 2,РежимОкругления.Окр15как20);;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат (РеализованнаяНаценка);
	
КонецФункции
